projects/drought/controllers/api/DmController.php

SELECT * FROM "hc_vung" WHERE "mavung"='1'
---
    public function actionTinh()
    {
        $value = app('request')->post('value');
        $mavung = data_get(app('request')->post('depdrop_parents'), '0');

        $list = collect(data_get(HcVung::find()->with('tinhs')->where(['mavung' => $mavung])->one(), 'tinhs'))->map(function ($item){
            return ['id' => $item->gid, 'name' => $item->tentinh];
        });

SELECT "code", "id" FROM "gallery" WHERE "type"=2
SELECT "id", "mavung", "tenvung" FROM "hc_vung"
---
    public function actionResults()
    {
        $data = Gallery::find()->select('code, id')->andWhere(['type' => 2])->asArray()->all();
        $data = collect($data)->map(function ($i){
            $layers = (string)Str::of($i['code'])->slug('_')->prepend('drought:m_v_');
            return array_merge($i, [
                'layers' => $layers,
            ]);
        })->all();

        $vung = collect(HcVung::find()->with('tinhs')->select('id, mavung, tenvung')->all())->map(function ($i){
            $cql = Str::of(implode(',', Arr::pluck($i->tinhs, 'gid')))->prepend('gid in (')->append(')');
            return [
                'value' => $i->id,
                'label' => $i->tenvung,
                'cql' => (string)$cql
            ];
        });